Revit 2026 API

# AreaLoadIsCurveLoopsInsideHostBoundaries Method

---
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsCurveLoopsInsideHostBoundaries(
	Document doc,
	ElementId hostId,
	IList<CurveLoop> loops
)
```
```vb
Public Shared Function IsCurveLoopsInsideHostBoundaries (
	doc As Document,
	hostId As ElementId,
	loops As IList(Of CurveLoop)
) As Boolean
```
```cpp
public:
static bool IsCurveLoopsInsideHostBoundaries(
	Document^ doc,
	ElementId^ hostId,
	IList<CurveLoop^>^ loops
)
```
```fsharp
static member IsCurveLoopsInsideHostBoundaries :
        doc : Document *
        hostId : ElementId *
        loops : IList<CurveLoop> -> bool
```

#### Parameters

doc Document

hostId ElementId

loops IListCurveLoop

#### Return Value

Boolean

#### Reference

AreaLoad Class

Autodesk.Revit.DB.Structure Namespace